Repository: taiwen/demo
Catalog: usr/locale/*/validator.po
Languages: fr

source: The input failed checksum validation
fr: La donnée entrée n'a pas passé le test de validation Checksum

source: The input contains invalid characters
fr: La donnée entrée contient des caractères invalides

source: The input should have a length of %length% characters
fr: La donnée entrée doit avoir une longueur de %lenght% caractères

source: Invalid type given. String expected
fr: Type de donnée invalide. Caractère attendu

source: The input is not between '%min%' and '%max%', inclusively
fr: La donnée entrée n'est pas comprise entre '%min%' et '%max%', inclus

source: The input is not strictly between '%min%' and '%max%'
fr: La donnée entrée n'est pas strictement comprise entre '%min%' et '%max%'

source: The input is not valid
fr: La donnée entrée n'est pas valide

source: An exception has been raised within the callback
fr: Une exception a été levée à l'intérieur du callback

source: Empty captcha value
fr: Value de Captcha vide

source: Captcha ID field is missing
fr: Le champ Captcha ID est manquant

source: Captcha value is wrong
fr: La valeur Captcha est erronnée.

source: The input seems to contain an invalid checksum
fr: La donnée entrée semble contenir un checksum non valide

source: The input must contain only digits
fr: La donnée entrée doit contenir seulement des chiffres

source: The input contains an invalid amount of digits
fr: La donnée entrée contienbt un nombre invalide de chiffres

source: The input is not from an allowed institute
fr: La donnée entrée n'est pas d'une organisation autorisée

source: The input seems to be an invalid credit card number
fr: La donnée entrée semble être une numéro de carte bancaire invalide

source: An exception has been raised while validating the input
fr: Une exception a été soulevée lors de la validation de la donnée entrée

source: The form submitted did not originate from the expected site
fr: Le formulaire soumis n'est pas originaire du site attendu

source: Invalid type given. String, integer, array or DateTime expected
fr: Type de donnée fournie non valide. Caractère, entier, tableau ou Date attendu.

source: The input does not appear to be a valid date
fr: La donnée entrée ne semble pas être une date valide

source: The input does not fit the date format '%format%'
fr: La donnée entrée ne correspond à au format de date '%format%'

source: The input is not a valid step
fr: La donnée entrée n'est pas une étape valide

source: No record matching the input was found
fr: Aucun enregistrement correspondant à la valeur entrée n'a été trouvé

source: A record matching the input was found
fr: Un enregistrement corrrespondant à la donnée entrée a été trouvé

source: The input is an empty string
fr: La donnée entrée est un caractère vide

source: Invalid type given. String, integer or float expected
fr: Type de donnée fournie non valide. Caractère, entier ou à virgule attendu

source: The input is not a valid email address. Use the basic format local-part@hostname
fr: La donnée entrée n'est une adresse mail valide. Utiliser le format de base local-part@domaine

source: '%hostname%' is not a valid hostname for the email address
fr: '%hostname%' n'est pas un domaine valide pour cette adresse email

source: '%hostname%' does not appear to have any valid MX or A records for the email address
fr: '%hostname%' ne semble pas avoir des champs MX ou A valides pour cette adresse email

source: '%hostname%' is not in a routable network segment. The email address should not be resolved from public network
fr: '%hostname%' ne fait pas partie d'un segment réseau routable. Cette adresse email ne semble pas pouvoir être routable depuis le réseau public

source: '%localPart%' can not be matched against dot-atom format
fr: '%localPart%' correspond pas au format dot-atom

source: '%localPart%' can not be matched against quoted-string format
fr: '%localPart%' correspond pas au format quoted-string

source: '%localPart%' is not a valid local part for the email address
fr: '%localPart%' n'est pas un nom valide pour une adresse email

source: The input exceeds the allowed length
fr: La donnée entrée dépasse la longueur autorisée

source: Invalid type given
fr: Type de donnée fournie invalide

source: Too many files, maximum '%max%' are allowed but '%count%' are given
fr: Trop de fichiers, un maximum de '%max%' est autorisé mais '%count%' sont fournis

source: Too few files, minimum '%min%' are expected but '%count%' are given
fr: Nombre trop faible de fichiers, un minumum de '%min%' est attendu mais '%count%' sont fournis

source: File does not match the given crc32 hashes
fr: Le fichier ne correspond pas aux hashs crc32 fournis

source: A crc32 hash could not be evaluated for the given file
fr: Un hash crc32 ne peut pas être évalué pour le fichier fourni

source: File is not readable or does not exist
fr: Le fichier n'est pas lisible ou n'existe pas

source: File has an incorrect extension
fr: Le fichier a une extension incorrecte

source: File does not exist
fr: Le fichier n'existe pas

source: All files in sum should have a maximum size of '%max%' but '%size%' were detected
fr: La somme des fichiers doit avoir une taille maximum de '%max%' mais une taille de '%size%' a été détectée.

source: All files in sum should have a minimum size of '%min%' but '%size%' were detected
fr: La somme de tous les fichiers doit avoir une taille minimum de '%min%' mais une taille de '%size%' a été détectée

source: One or more files can not be read
fr: Un ou plusieurs fichiers ne peuvent être lus

source: File does not match the given hashes
fr: Le fichier ne correspond pas au hash fourni

source: A hash could not be evaluated for the given file
fr: Un hash n'a pas pu être évalué pour ce fichier fourni

source: Maximum allowed width for image should be '%maxwidth%' but '%width%' detected
fr: La largeur maximale d'une image doit être de '%maxwidth%' mais '%width%' a été détecté

source: Minimum expected width for image should be '%minwidth%' but '%width%' detected
fr: La largeur minimum d'une image doit être de '%minwidth%' mais '%width%' a été détecté

source: Maximum allowed height for image should be '%maxheight%' but '%height%' detected
fr: La hauteur maximale pour une image doit être de '%maxheight%' mais '%height%' a été détecté

source: Minimum expected height for image should be '%minheight%' but '%height%' detected
fr: La hauteur minimum pour une image est de '%minheight%' mais '%height%' a été détecté

source: The size of image could not be detected
fr: La taille de l'image ne peut pas être détectée

source: File is not compressed, '%type%' detected
fr: Le fichier n'est pas compressé, '%type%' détecté

source: The mimetype could not be detected from the file
fr: Le mimetype ne peut pas être détecté pour ce fichier

source: File is no image, '%type%' detected
fr: Le fichier n'est pas une image, '%type%' détecté

source: File does not match the given md5 hashes
fr: Le fichier ne correspond pas aux hashs md5 fournis

source: An md5 hash could not be evaluated for the given file
fr: Le hash md5 ne peut être évalué pour le fichier fourni

source: File has an incorrect mimetype of '%type%'
fr: Le fichier a un mimetype incorrect '%type%'

source: File exists
fr: Le fichier existe

source: File does not match the given sha1 hashes
fr: Le fichier ne correspond pas aux hashs sha1 fournis

source: A sha1 hash could not be evaluated for the given file
fr: Un hash sha1 ne peut être évalué pour le fichier fourni

source: Maximum allowed size for file is '%max%' but '%size%' detected
fr: La taille maximale autorisée est de '%max%' mais '%size%' a été détecté

source: Minimum expected size for file is '%min%' but '%size%' detected
fr: Une taille minimum de '%min%' est attendue pour un fichier, mais '%size%' détecté

source: File '%value%' exceeds the defined ini size
fr: Le fichier '%value%' dépasse la taille ini définie

source: File '%value%' exceeds the defined form size
fr: Le fichier '%value%' dépasse le taille définie dans le formulaire

source: File '%value%' was only partially uploaded
fr: Le fichier '%value%' n'a été que partiellement uploadé

source: File '%value%' was not uploaded
fr: Le fichier '%value%' n'a pas été uploadé

source: No temporary directory was found for file '%value%'
fr: Aucune répertoire temporaire n'a été trouvé pour le fichier '%value%'

source: File '%value%' can't be written
fr: Impossible d'écrire dans le fichier '%value%'

source: A PHP extension returned an error while uploading the file '%value%'
fr: Une extension PHP a retourné une erreur pendant l'upload du fichier %value%'

source: File '%value%' was illegally uploaded. This could be a possible attack
fr: Le fichier '%value%' a été illégalement uploadé. Ceci pourrait être une attaque

source: File '%value%' was not found
fr: Le fichier'%value%' n'a pas été trouvé

source: Unknown error while uploading file '%value%'
fr: Erreur inconnue lors de l'upload du fichier '%value%'

source: File exceeds the defined ini size
fr: Le fichier dépasse la taille ini définie

source: File exceeds the defined form size
fr: Le fichier dépasse le taille définie dans le formulaire

source: File was only partially uploaded
fr: Le fichier n'a été que partiellement uploadé

source: File was not uploaded
fr: Le fichier n'a pas été uploadé

source: No temporary directory was found for file
fr: Aucune répertoire temporaire n'a été trouvé pour ce fichier

source: File can't be written
fr: Impossible d'écrire dans le fichier

source: A PHP extension returned an error while uploading the file
fr: Une extension PHP a retourné une erreur lors de l'upload du fichier

source: File was illegally uploaded. This could be a possible attack
fr: Le fichier a été illégalement uploadé. Ceci peut être une attaque potentielle

source: File was not found
fr: Le fichier n'a pas été trouvé

source: Unknown error while uploading file
fr: Erreur inconnue lors de l'upload du fichier

source: Too many words, maximum '%max%' are allowed but '%count%' were counted
fr: Trop de mots, un maximum de '%max%' est autorisé mais un nombre de '%count%' a été compté

source: Too few words, minimum '%min%' are expected but '%count%' were counted
fr: Pas assez de mots, un minimum de '%min%' est attendu mais '%count%' ont été comptés

source: The input is not greater than '%min%'
fr: La donnée entrée n'est pas plus grande que '%min%'

source: The input is not greater or equal than '%min%'
fr: La donnée entrée n'est plus grande ou égale à '%min%'

source: The input contains non-hexadecimal characters
fr: La donné entrée compris des caractères non-hexadécimaux

source: The input appears to be a DNS hostname but the given punycode notation cannot be decoded
fr: La donnée entrée semble être un domaine DNS mais le punycode notation fourni ne peut être décodé

source: The input appears to be a DNS hostname but contains a dash in an invalid position
fr: La donnée entrée semble être un domaine DNS mais contient un tiret à un endroit non valide

source: The input does not match the expected structure for a DNS hostname
fr: La donnée entrée ne correspond pas à la structure attendue d'un domaine DNS

source: The input appears to be a DNS hostname but cannot match against hostname schema for TLD '%tld%'
fr: La donnée entrée semble être un domaine DNS mais ne correspond pas au schéma de domaine pour le TLD '%tld%'

source: The input does not appear to be a valid local network name
fr: La donnée entrée ne semble pas être un nom de réseau local valide

source: The input does not appear to be a valid URI hostname
fr: La donnée entrée ne semble pas être une adresse de domaine URI valide

source: The input appears to be an IP address, but IP addresses are not allowed
fr: La donnée entrée semble être une adresse IP, mais les adresses IP ne sont pas autorisées

source: The input appears to be a local network name but local network names are not allowed
fr: La donnée entrée semble être un nom de réseau local mais les noms de réseaux locaux ne sont pas autorisés

source: The input appears to be a DNS hostname but cannot extract TLD part
fr: La donnée entrée semble être un domaine DNS mais impossible d'extraire la valeur TLD

source: The input appears to be a DNS hostname but cannot match TLD against known list
fr: La donnée entrée semble être un domaine DNS mais ne correspond pas à une liste de TLD connus

source: The input contains characters which are non alphabetic and no digits
fr: La donnée entrée contient des caractères non alphabétiques ou non numériques

source: The input contains non alphabetic characters
fr: La donnée entrée comprend des caractères non alphabétiques

source: The input does not appear to be a valid datetime
fr: La donnée entrée ne semble pas être une date valide

source: The input does not appear to be a float
fr: La donnée entrée ne semble pas être un nombre à virgule

source: Invalid type given. String or integer expected
fr: Type de donnée fourni non valide. Caractère ou entier attendu.

source: The input does not appear to be an integer
fr: La donnée entrée ne semble pas être un entier

source: The input does not match a phone number format
fr: La donnée entrée ne correspond pas à un format de numéro de téléphone

source: The country provided is currently unsupported
fr: La pays saisis n'est pas actuellement géré

source: The input does not appear to be a postal code
fr: La donnée saisie ne semble pas être un code postal

source: Unknown country within the IBAN
fr: Pays inconnu dans le code IBAN

source: Countries outside the Single Euro Payments Area (SEPA) are not supported
fr: Les pays en dehors du SEPA (Single Euro Payments Area) ne sont pas supportés

source: The input has a false IBAN format
fr: La donnée entrée a un format IBAN erronné

source: The input has failed the IBAN check
fr: La donnée entrée a échoué au contrôle IBAN

source: The two given tokens do not match
fr: Le deux tokens fournis ne correspondent pas

source: No token was provided to match against
fr: Aucun token n'as été fourni pour être comparé

source: The input was not found in the haystack
fr: La donnée entrée n'a pas été trouvée dans le haystack

source: The input does not appear to be a valid IP address
fr: La donnée entrée ne semble pas être une adresse IP valide

source: The input is not an instance of '%className%'
fr: La donnée entrée n'est pas une instance de '%className%'

source: The input is not a valid ISBN number
fr: La donnée entrée n'est pas un numéro ISBN valide

source: The input is not less than '%max%'
fr: La donnée entrée n'est pas inférieur à '%max%'

source: The input is not less or equal than '%max%'
fr: La donnée entrée n'est pas inférieur ou égale à '%max%'

source: Value is required and can't be empty
fr: Une valeur est requise et ne peut être vide

source: Invalid type given. String, integer, float, boolean or array expected
fr: Type de donnée fournie non valide. Caractère, entier, à virgule, booléen ou tableau attendu

source: The input does not match against pattern '%pattern%'
fr: La donnée entrée ne correspond pas au modèle '%pattern%'

source: There was an internal error while using the pattern '%pattern%'
fr: Une erreur interne a été détectée lors de l'utilisation du modèle '%pattern%'

source: The input is not a valid sitemap changefreq
fr: La donnée entrée n'est pas une fréquence de mise à jour valide pour un sitemap

source: The input is not a valid sitemap lastmod
fr: La donnée entrée n'est pas une date dernière modification valide pour un sitemap

source: The input is not a valid sitemap location
fr: La donnée entrée n'est pas un lieu valide pour un sitemap

source: The input is not a valid sitemap priority
fr: La donnée entrée n'est pas une priorité valide pour un sitemap

source: Invalid type given. Numeric string, integer or float expected
fr: Type de donnée fournie non valide. Caractère numérique, entier ou à virugle attendu

source: Invalid value given. Scalar expected
fr: Value donnée non valide. Scalaire attendu

source: The input is less than %min% characters long
fr: La donnée entrée est de moins de %min% caractères de long

source: The input is more than %max% characters long
fr: La donnée entrée est de plus de %max% caractères de long

source: The input does not appear to be a valid Uri
fr: La donnée entrée ne semble pas être une Uri valide
