Repository: taiwen/demo
Catalog: www/setup/locale/*/default.po
Languages: fr

source: Web server
fr: Serveur Web

source: Persist options
fr: Options de Persistance

source: PDO drivers
fr: Drivers PDO

source: The Alternative PHP Cache (APC) is highly recommended for high-performance scenario. Refer to <a href="http://www.php.net/manual/en/intro.apc.php" target="_blank" title="APC introduction">APC introduction</a> for details.
fr: Alternative PHP Cache (APC) est hautement recommandé pour un scenario haute-performance. Se référer à la page <a href="http://www.php.net/manual/en/intro.apc.php" target="_blank" title="APC introduction">APC introduction</a> pour plus de détails.

source: The extension is highly recommended for performance scenario and advanced data structure. Refer to <a href="http://redis.io" target="_blank" title="Redis">Redis page</a> for details.
fr: L'extension est hautement recommandée pour un scenario de performance et une structure évoluée de données. Se référer à la <a href="http://redis.io" target="_blank" title="Redis">page Redis</a> pour plus de détails.

source: Memcached is highly recommended for high-performance yet robust distributed scenario. However it is not suitable for shared-hosting usage since tag is not supported. Refer to <a href="http://www.php.net/manual/en/intro.memcached.php" target="_blank" title="Memcached introduction">Memcached introduction</a> for details.
fr: Memcached est hautement recommandé pour une haute performance dans un environnement distribué. Cependant il n'est pas adapté aux hébergements mutualisés car tag n'est pas supporté. Se référer à la page <a href="http://www.php.net/manual/en/intro.memcached.php" target="_blank" title="Memcached introduction">Memcached introduction</a> pour plus de détails.

source: Memcache a widely used cache engine. However it is not suitable for shared-hosting usage since tag is not supported. Refer to <a href="http://www.php.net/manual/en/intro.memcache.php" target="_blank" title="Memcache introduction">Memcache introduction</a> for details.
fr: Memcache est un système de cache largement utilisé. Cependant il n'est pas adapté à l'hébergement mutualisé car tag n'est pas supporté. Se référer à la page <a href="http://www.php.net/manual/en/intro.memcache.php" target="_blank" title="Memcache introduction">Memcache introduction</a> pour plus de détails.

source: The extension allows to connect and communicate to different types of servers with different types of protocols, check <a href="http://www.php.net/manual/en/book.curl.php" title="cURL" target="_blank">cURL</a> for details.
fr: L'extension permet de se connecter et de communiquer avec différents types de serveurs et avec différents types de protocole, se référer à la page <a href="http://www.php.net/manual/en/book.curl.php" title="cURL" target="_blank">cURL</a> pour plus de détails.

source: Internationalization extension enables collation and date/time/number/currency formatting, check <a href="http://www.php.net/manual/en/book.intl.php" title="Internationalization extension" target="_blank">Internationalization extension</a> for details.
fr: L'extension Internationalization active la collation et les formats de date/temps/nombres/monnaie, se référer à la page <a href="http://www.php.net/manual/en/book.intl.php" title="Internationalization extension" target="_blank">Internationalization extension</a> pour plus de détails.

source: The extension is suggested for text parser, check <a href="http://daringfireball.net/projects/markdown/" title="Markdown project" target="_blank">Markdown</a> for details and download from <a href="http://pecl.php.net/package/markdown" title="PECL project" target="_blank">PECL page</a>.
fr: L'extension est suggérée pour le parser de texte, se référer à la page <a href="http://daringfireball.net/projects/markdown/" title="Markdown project" target="_blank">Markdown</a> pour plus de détails, et pour un téléchargement allez à la page <a href="http://pecl.php.net/package/markdown" title="PECL project" target="_blank">PECL</a>.

source: The extension is required for multibyte string processing, check <a href="http://www.php.net/manual/en/book.mbstring.php" title="Multibyte String" target="_blank">Multibyte String</a> for details.
fr: L'extension est requise pour le traitement des chaînes multibytes, se référer à la page <a href="http://www.php.net/manual/en/book.mbstring.php" title="Multibyte String" target="_blank">Multibyte String</a> pour plus de détails.

source: Presettings
fr: Serveur

source: Presettings and server configuration detection
fr: Détection et choix de la configuration serveur

source: Basic
fr: Site

source: Basic settings for website
fr: Paramètres de base du site web

source: Database
fr: Données

source: Database settings
fr: Paramètres Base de données

source: Administrator
fr: Administrateur

source: System and administrator account creation
fr: Création du compte Administrateur Système

source: Finish
fr: Terminer

source: Finishing installation process
fr: Installation terminée

source: Database connection is failed.
fr: La connexion à la base de données a échoué

source: System module uninstallation is failed. Please continue to try again.
fr: La désinstallation du module Système a échoué. Merci d'essayer de nouveau.

source: Information is required.
fr: L'information est obligatoire.

source: Invalid Email.
fr: Email invalide

source: The two passwords do not match
fr: Les deux mots de passe ne correspondent pas

source: System module installation is failed. Please continue to try again.
fr: L'installation du module Système a échoué. Merci d'essayer de nouveau.

source: Username is required.
fr: Le Nom Utilisateur est obligatoire.

source: Name is required.
fr: Le Nom est obligatoire.

source: Email is required.
fr: L'Email est obligatoire

source: Password is required.
fr: Le Mot de Passe est obligatoire

source: Deprecated tables exist in the database. Please continue to re-install.
fr: Des tables dépréciées sont présentes dans la base de données. Merci de continuer pour re-installer.

source: Admin email
fr: Email Admin

source: Admin username
fr: Nom utilisateur Admin

source: Admin name
fr: Nom Admin

source: Admin password
fr: Mot de Passe Admin

source: Confirm password
fr: Confirmer le mot de passe

source: Administrator account
fr: Compte Administrateur

source: Database validation is failed.
fr: La vérification de la base de donnée a échoué.

source: Configuration file write error
fr: Erreur d'écriture sur le fichier de configuration

source: The configuration file "%s" is not written correctly.
fr: Le fichier de configuration "%s" ne s'est pas crée correctement.

source: Server hostname
fr: Nom Serveur d'Hébergement

source: Hostname (and port, delimited by ":") or Unix socket of the database server. If you are unsure, "localhost" works in most cases, or "127.0.0.1"
fr: Serveur d'hébergement (et port, délimité par ":") ou le socket Unix du serveur base de données. Si vous n'êtes pas sûr, "localhost" convient dans la majorité des cas, ou bien "127.0.0.1"

source: User name
fr: Nom Utilisateur

source: Name of the user account that will be used to connect to the database server
fr: Nom du compte utilisateur qui sera utilisé pour se connecter au serveur base de données

source: Password
fr: Mot de passe

source: Password of your database user account
fr: Mot de passe pour votre compte utilisateur base de données

source: Database name
fr: Nom Base de données

source: The name of database on the host. The database must be already available.
fr: Le nom de la base de données sur l'hébergement. La base de données doit être déja disponible.

source: Table prefix
fr: Préfixe des Tables

source: This prefix will be added to all new tables created to avoid name conflicts in the database. If you are unsure, just keep the default.
fr: Ce préfixe sera ajouté à toutes les tables crées afin d'éviter les conflits de nommage dans la base de données. Si vous n'êtes pas sûrs, conserver simplement la valeur par défaut.

source: Database setup
fr: Configuration de la base de données

source: Settings for database
fr: Paramètres de la base de données

source: %s is NOT writable.
fr: %s n'est PAS disponible en écriture.

source: Configuration file copy error
fr: Erreur de copie du fichier de configuration

source: The configuration files are not copied correctly or not readable, please create and/or set read permissions for the files manually.
fr: Les fichiers de configuration ne se sont pas copiés correctement ou ne sont pas lisibles, merci de créer et/ou de définir manuellement les permissions sur les fichiers.

source: Power your web and mobile applications.
fr: Propulse vos applications web et mobiles

source: Identifier
fr: Identifiant

source: Unique identifier to distinguish this website. If there are multiple sites installed, make sure the identifier is unique.
fr: Identifiant unique afin de distinguer ce site web. S'il y a plusieurs sites installés, assurez-vous que l'identifiant est unique.

source: Name
fr: Nom

source: Name for the website.
fr: Nom du site web

source: Website slogan.
fr: Slogan du site web.

source: Primary settings
fr: Paramètres essentiels

source: Primary settings for your website.
fr: Paramètres fondamentaux de votre site web

source: File system
fr: Système par fichier

source: Caching storage with files on disks specified in following steps.
fr: Méthode de cache par fichiers situés sur disques indiqué dans les étapes suivantes.

source: Persistent data container
fr: Dosssier de stockage des données persistantes

source: Choose the proper backend container for persistent data
fr: Choississez le bon dossier de stockage de vos données persistantes

source: Documents root physical path
fr: Chemin physique du Document Racine

source: Physical path to the documents (served) directory without trailing slash.
fr: Chemin physique pour le répertoire serveur des documents, sans slash de fin.

source: Website location (URL)
fr: Adresse du site web (URL)

source: Main URL that will be used to access your Pi Engine
fr: URL principale qui sera utilisée pour accéder à votre site sous Pi Engine

source: Upload directory
fr: Répertoire d'Upload

source: Physical path to upload directory without trailing slash. A relative path will be allocated in PI root directory; PHP disabled.
fr: Chemin physique du répertoire d'upload, sans slash de fin. Un chemin relatif sera alloué dans votre répertoire racine PI ; PHP désactivé.

source: URL of upload root
fr: URL racine pour l'upload

source: URL that will be used to access upload directory. PI root URL will be prepended if relative URL is used.
fr: URL qui sera utilisée pour accéder au répertoire d'upload. L'URL racine PI sera ajoutée devant si une URL relative est utilisée.

source: Static file directory
fr: Répertoire des fichiers statiques

source: Physical path to static file directory without trailing slash; PHP disabled.
fr: Chemin physique pour le répertoire de fichiers statiques dans slash de fin; PHP désactivé.

source: URL of static file root directory
fr: URL du répertoire racine des fichiers statiques

source: URL that will be used to access static files. Upload URL will be used if static directory is not set explicitly.
fr: URL qui sera utilisée pour accéder aux fichiers statiques. L'URL l'upload sera utilisée si le répertoire de fichiers statiques n'est pas défini explicitement.

source: Library directory
fr: Répertoire des Librairies

source: Physical path to library directory without trailing slash. Locate the folder out of web directory to make it secure; PHP executable
fr: Chemin physique du repertoire des Librairies sans slash de fin. Placez le dossier en dehors du répertoire web pour le sécuriser; PHP y est exécutable.

source: Data file directory
fr: Répertoire des fichiers de données

source: Physical path to the data files (writable) directory WITHOUT trailing slash. Locate the folder out of web directory to make it secure; PHP executable
fr: Chemin physique du répertoire des fichiers de données (ouvert en écriture) SANS slash de fin. Placez le dossier en dehors du répertoire web pour le sécuriser; PHP y est exécutable.

source: Root directory for user applications
fr: Répertoire racine pour les applications utilisateur

source: Physical path to user contributed directory WITHOUT trailing slash.. Locate the folder out of web directory to make it secure; PHP executable
fr: Chemin physique du répertoire des contributions utilisateur SANS slash de fin. Placez le dossier en dehors du répertoire web pour sécuriser ; PHP y est exécutable.

source: Basic settings
fr: Paramètres généraux

source: Settings required by system
fr: Paramètres requis par le système

source: Advanced settings
fr: Paramétrages avancés

source: Settings that can help improve security, deployment flexibility, etc. If you are unsure about it, leave as it is.
fr: Ces paramètres peuvent vous aider à améliorer la sécurité, à faciliter les déploiements, etc. Si vous n'êtes pas sûrs, laisser tel quel.

source: Path settings
fr: Paramètrages des Chemins / Paths

source: Path and URL settings
fr: Paramètres Chemin et URL

source: Congratulations!
fr: Félicitations !

source: The system is set up successfully.
fr: Le système a été installé avec succès.

source: Click to visit your website!
fr: Cliquez ici pour visiter votre site web !

source: Visit <a href="http://pialog.org/" rel="external">Pi Engine Development Site</a> in case you need any help.
fr: Visitez <a href="http://pialog.org/" rel="external">le Site de Développement Pi Engine</a> pour tout besoin d'aide.

source: Security advisory
fr: Avertissement de Sécurité

source: For security considerations please make sure the following operations are done:
fr: Pour des raisons de sécurité, assurez-vous que les opérations suivantes ont été réalisées :

source: Remove the installation folder <strong>{www}/setup/</strong> from your server manually.
fr: Supprimer le répertoire d'installation <strong>{www}/setup/</strong> de votre serveur manuellement.

source: Set configuration directories and files to readonly:
fr: Paramétrer les fichiers et répertoires de configuration en lecture seule:

source: Language Selection
fr: Sélection de la langue

source: Choose the language for the installation and website.
fr: Choisissez la langue d'installation et de fonctionnement du site web

source: Sever setting detection
fr: Détection des paramètres serveur

source: Validate server settings and extensions
fr: Validez les paramètres et les extensions du serveur

source: System requirements
fr: Pré-requis système

source: Server settings and system extensions required by Pi Engine
fr: Paramètres serveur et extensions système requis par Pi Engine

source: Invalid
fr: Non valide

source: Not available
fr: Non disponible

source: Valid
fr: Valide

source: System extension recommendations
fr: Extensions système recommandées

source: Extensions recommended for better functionality or performance
fr: Extensions recommandées pour un meilleur fonctionnement ou de meilleures performances

source: Unknown
fr: Inconnu

source: Make sure that configurations have been set up correctly for nginx. Refer to <a href="http://nginx.net" title="nginx" target="_blank">nginx</a> and <a href="http://dev.xoopsengine.org" title="Pi Engine" target="_blank">Pi Engine Dev</a> for instructions.
fr: Assurez-vous que les paramétrages ont été effectués correctement pour nginx. Se référer aux pages <a href="http://nginx.net" title="nginx" target="_blank">nginx</a> et <a href="http://dev.xoopsengine.org" title="Pi Engine" target="_blank">Pi Engine Dev</a> pour les instructions.

source: Apache "mod_rewrite" module is required, however it is not detected. Check <a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html" title="mod_rewrite" target="_blank">mod_rewrite</a> for details.
fr: Le module Apache "mod_rewrite" est requis, cependant il n'a pas été détecté. Se référer à la page <a href="http://httpd.apache.org/docs/current/mod/mod_rewrite.html" title="mod_rewrite" target="_blank">mod_rewrite</a> pour plus de détails.

source: The webserver is currently not supported, please use <a href="http://nginx.net" title="nginx" target="_blank">nginx</a> or <a href="http://www.php.net/manual/en/book.apache.php" target="_blank" title="Apache">Apache</a>.
fr: Ce serveur web n'est pas encore supporté, merci d'utiliser <a href="http://nginx.net" title="nginx" target="_blank">nginx</a> ou <a href="http://www.php.net/manual/en/book.apache.php" target="_blank" title="Apache">Apache</a>.

source: Version 5.4.0 or higher is required.
fr: La version 5.4.0 ou plus est requise.

source: PHP Data Objects (PDO) extension with MySQL driver is required for regular Pi Engine instances, check <a href="http://www.php.net/manual/en/book.pdo.php" title="PDO" target="_blank">PDO manual</a> for details.
fr: L'extension PHP Data Objects (PDO) avec le driver MySQL est requis pour les instances normale de Pi Engine, se référer au <a href="http://www.php.net/manual/en/book.pdo.php" title="PDO" target="_blank">manuel PDO </a> pour plus de détails.

source: There is no recommended persist engine available. One of the following extensions is recommended: %s
fr: Il n'y a pas de moteur de persistance recommandé disponible. L'une des extensions suivantes est recommandée : %s

source: Pi Engine Setup Wizard
fr: Assistant d'Installation Pi Engine

source: Previous
fr: Précédent

source: Reload
fr: Recharger

source: Next
fr: Suivant
