Repository: taiwen/demo
Catalog: usr/module/widget/locale/*/admin.po
Languages: fr

source: Max file size
fr: Taille maximale fichier

source: Allowed image file to upload (in KB), 0 for no limit
fr: Fichier image autorisé en upload (en KB), 0 pour aucune limite

source: File extensions
fr: Extensions fichier

source: Extensions for images to upload, separate `,`.
fr: Extensions pour les images en upload, séparées par `,`.

source: Max image width
fr: Largeur maximale des images

source: Allowed image width, 0 for no limit
fr: Largeur image autorisée, 0 pour aucune limite

source: Max image height
fr: Hauteur maximale de l'image

source: Allowed image height, 0 for no limit
fr: Hauteur image autorisée, 0 pour aucune limite

source: Image width for media
fr: Largeur image pour les médias

source: Default value for widgets
fr: Valeur par défaut des widgets

source: Image height for media
fr: Hauteur image pour les médias

source: Image width for carousel
fr: Largeur image pour le carrousel

source: Image height for carousel
fr: Hauteur image pour le carrousel

source: Image width for spotlight
fr: Largeur image pour le spotlight

source: Image height for spotlight
fr: Hauteur image pour le spotlight

source: Open new window
fr: Ouvrir une nouvelle fenêtre

source: Open new window for widgets not specified
fr: Ouverture d'une nouvelle fenêtre pour les widgets non spécifiée

source: Management of custom blocks/widgets.
fr: Management des blocs personnalisés/widgets.

source: Script widgets
fr: Widgets Script

source: Widget list
fr: Liste des Widgets

source: Add new
fr: Ajouter un nouveau

source: Static widgets
fr: Widgets statiques

source: Edit
fr: Editer

source: Add HTML
fr: Ajouter HTML

source: Add text
fr: Ajouter Text

source: Add markdown
fr: Ajouter Markdown

source: List group
fr: Groupe de listes

source: Media list
fr: Liste Media

source: Carousel
fr: Carrousel

source: Compound tabs
fr: A onglets composés

source: Carousel widgets
fr: Widgets Carrousel

source: Spotlight widgets
fr: Widgets Spotlight

source: Block to display navigation menu and breadcrumbs
fr: Bloc pour afficher le menu de navigation et les breadcrumbs

source: Navigation name
fr: Nom Navigation

source: Display menu
fr: Menu Affichage

source: ul class for menu
fr: classe ul pour les menus

source: Separate classes with space
fr: Séparer les classes avec un espace

source: Minimum depth for menu
fr: Profondeur minimum du menu

source: Maximum depth for menu
fr: Profondeur maximum du menu

source: Separator for breadcrumb
fr: Séparateur pour les breadcrumbs

source: Minimum depth for breadcrumb
fr: Profondeur minimum pour les breadcrumb

source: Add link to last page
fr: Ajouter un lien à la dernière page

source: Pi Engine Updates
fr: Mises à jour Pi Engine

source: Block to display Pi Engine new updates on GitHub
fr: Bloc pour afficher les nouvelles mises à jour Pi Engine de GitHub

source: Image width
fr: Largeur Image

source: Image height
fr: Hauteur Image

source: Max rows to display
fr: Nombre maximum de lignes à afficher

source: No limit
fr: Aucune limite

source: 1 row
fr: 1 ligne

source: %d rows
fr: %d lignes

source: Open link in new window
fr: Ouvrir le lien dans une nouvelle fenêtre

source: Time interval (ms)
fr: Intervalle de temps (ms)

source: Mouse event
fr: Effet passage souris

source: Event to pause cycle
fr: Evènement pour mettre en pause le défilement

source: The widget "%s" is installed.
fr: Le widget "%s" est installé.

source: The widget "%s" is not installed.
fr: Le widget "%s" n\'est pas installé.

source: Block data saved successfully.
fr: Les données du bloc ont été enregistrées avec succès.

source: Block data not saved.
fr: Les données de bloc n'ont pas été enregistrées

source: Invalid data, please check and re-submit.
fr: Données non valides, merci de vérifier et de re-soumettre.

source: Add a block
fr: Ajouter un bloc

source: Block edit
fr: Editer le bloc

source: The widget is removed.
fr: Le widget a été supprimé.

source: The widget is not removed.
fr: Le widget n'a pas été supprimé.

source: Title
fr: Nom

source: Unique name
fr: Nom unique

source: Submit
fr: Valider

source: Content
fr: Contenu

source: Tags supported: `%sitename%` - site name; `%siteurl%` - site root URL; `%slogan%` - site slogan
fr: Tags supportés : `%sitename%` - nom du site ; `%siteurl%` - URL racine du site ; `%slogan%` - slogan du site

source: Content type
fr: Type de contenu

source: Bootstrap slide
fr: Slide Boostrap

source: Bootstrap two columns
fr: Boostrap deux colonnes

source: jQuery riding Carousel
fr: Carrousel défilant jQuery

source: Parallax Content Slider
fr: Slider de Contenus Parallax

source: Title only
fr: Nom seulement

source: Title and summary
fr: Nom et Résumé

source: Custom:
fr: Personalisé :

source: Image on left
fr: Image à gauche

source: Image on right
fr: Image à droite

source: Spot on top
fr: Spot au dessus

source: Spot on left
fr: Spot à gauche

source: Pi Highlights
fr: Pi en résumé

source: Introduction to Pi Engine with carousel.
fr: Introduction à Pi Engine avec un carrousel

source: Sustainable ecosystem
fr: Ecosystème complêt

source: A sustainable ecosystem built upon open standard, open source code, open development and open management on Github.
fr: Un ecosystèm complet construit à partir de standards ouverts, un code source ouvert, un développement et un management participatif sur Github.

source: Engineered development
fr: Plateforme de développement professionnelle

source: Quality ensured engineering development with short learning curve, low skill requirements with clean MVC architecture, semantic templating, sophisticated API and strict standards.
fr: Plateforme de développement professionnelle et de qualité garantissant une prise en main rapide, et facile d'accès : une architecture MVC claire, des gabarits/templates semantiques, une API sophistiquée, et des standards de développement stricts.

source: Visualization of application management
fr: Management graphique de l'application

source: Easy and responsive application and content management based on visualized management tools and interface with page and widget mechanism.
fr: Application ergonomique et rapide, gestion de contenus basée sur des outils d'administrations graphiques et le management de page et de widgets.

source: Agile compliant development workflow
fr: Compatible avec les processus de développement agiles

source: Role oriented architecture and deployment skeleton supports managable agile development workflow.
fr: L'architecture orientée Rôles et les mécanismes de déploiements permettent le pilotage de processus de développement agile.

source: Updates from GitHub
fr: Mises à jour depuis GitHub

source: Widget name already exists
fr: Ce nom de widget existe déja

source: Install
fr: Installer

source: Delete
fr: Supprimer

source: Items
fr: Eléments

source: Click to add new item.
fr: Cliquer pour ajouter un nouvel élément.

source: Click to remove
fr: Cliquer pour supprimer

source: Caption
fr: Sous-titre

source: Link
fr: Lien

source: Summary
fr: Résumé

source: Click to upload image then add item contents.
fr: Cliquer pour uploader l'image et ensuite ajoute les contenus de l'élément.

source: Select from below available module blocks to add.
fr: Sélectionner en dessous les blocs disponibles pour le module à ajouter

source: Module blocks
fr: Blocs Module
