Repository: taiwen/demo
Catalog: usr/module/user/locale/*/admin.po
Languages: fr

source: Login
fr: Connexion

source: Registration
fr: Inscription

source: Account
fr: Compte

source: List limit
fr: Limite de liste

source: Number of items on list page.
fr: Nombre d'éléments sur la page de liste

source: Birthdate format
fr: Format date de naissance

source: Format for birthdate display.
fr: Format de l'affichage de la date de naissance

source: Email expiration
fr: Durée expiration Email

source: Expiration time for email/password reset (in hours).
fr: Durée d'expiration pour la réinitialisation de l'adresse email/mot de passe (en heure)

source: Email confirmation
fr: Confirmation de l'Email

source: Email confirmation with token is required for email change.
fr: Une confirmation par mail et token est requise pour modifier l'email

source: Profile complete
fr: Profil complet

source: Require user to complete profile data.
fr: Exiger de l'utilisateur qu'il complète ses données profil

source: Login disable
fr: Désactiver la connexion

source: Disable user login
fr: Désactiver la connexion utilisateur

source: Login CAPTCHA
fr: Connexion CAPTCHA

source: Enable CAPTCHA for user login
fr: Activer le CAPTCHA pour la connexion utilisateur

source: Remember me
fr: Se souvenir

source: Days to remember login, 0 for disable.
fr: Nb jours pour la fonction Se Souvenir, 0 pour désactiver

source: Login field
fr: Champs de connexion

source: Identity field(s) for authentication.
fr: Champs d'identité utilisé(s) pour se connecter

source: Username
fr: Nom utilisateur

source: Maximum attempts
fr: Nb tentatives maximums

source: Maximum attempts allowed to try for user login
fr: Nb tentatives maximums autorisées pour se connecter

source: Register disable
fr: Désactiver l'inscription

source: Disable user registration
fr: Désactiver l'inscription utilisateur

source: Register CAPTCHA
fr: Inscription CAPTCHA

source: Enable CAPTCHA for user registration
fr: Activer le CAPTCHA pour l'inscription utilisateur

source: Register complete
fr: Terminer l'inscription

source: Require user to complete register data in an extra form.
fr: Exige de l'utilisateur qu'il termine son inscription via un formulaire additionnel

source: Email notification
fr: Email de notification

source: Send email notification for register success.
fr: Envoyer un mail de notification en cas de succès de l'inscription

source: Activation mode for user accounts
fr: Mode d'activation pour les comptes utilisateurs

source: Automatically activated
fr: Confirmé automatiquement

source: Activated by user email
fr: Confirmation par mail utilisateur

source: Activated by admin approval
fr: Confirmé par l'approbation administrateur

source: Activation expiration
fr: Expiration de l'activation

source: Expiration time for activation email (in hours).
fr: Durée d'expiration pour l'activation par mail (en heures).

source: Username format
fr: Format Nom utilisateur

source: Format of username for registration.
fr: Format du nom utilisateur lors de l'inscription

source: Strict: alphabet or number only
fr: Strict : alphabet ou numérique seulement

source: Medium: ASCII characters
fr: Medium : caractères ASCII

source: Loose: multi-byte characters
fr: Bas : caractères multibytes

source: Minimum username
fr: Nom utilisateur minimum

source: Minimum length of username for user registration
fr: Longueur minimum du nom utilisateur lors de l'inscription

source: Maximum username
fr: Nom utilisateur maximum

source: Maximum length of username for user registration
fr: Longueur maximum du nom utilisateur lors de l'inscription

source: Display name format
fr: Format du pseudo

source: Format of display name for registration.
fr: Format du pseudo lors de l'inscription

source: Minimum display name
fr: Nom minimum

source: Minimum length of display name for user registration
fr: Longueur minimum du nom utilisateur lors de l'inscription

source: Maximum display name
fr: Nom maximum

source: Maximum length of display name for user registration
fr: Longueur maximum du pseudo lors de l'inscription

source: Minimum password
fr: Mot de passe minimum

source: Minimum length of password for user registration
fr: Longueur minimale du mot de passe lors de l'inscription

source: Maximum password
fr: Mot de passe maximum

source: Maximum length of password for user registration
fr: Longueur maximale du mot de passe lors de l'inscription

source: Username blacklist
fr: Liste noire Nom utilisateur

source: Reserved and forbidden username list, separated with `|`, regexp syntax is allowed.
fr: Liste des noms utilisateurs réservés/interdits, séparés par `|`, la syntaxe regexp est autorisée.

source: Display blacklist
fr: Liste noire pseudo

source: Reserved and forbidden display name list, separated with `|`, regexp syntax is allowed.
fr: Liste des pseudos réservés / interdits, séparés par `|`, la syntaxe regexp est autorisée.

source: Email blacklist
fr: Liste noire Email

source: Forbidden email list, separated with `|`, regexp syntax is allowed.
fr: Liste des emails interdits, séparés par `|`, la syntaxe regexp est autorisée

source: Max Avatar Width
fr: Largeur maximale avatar

source: Allowed image width, 0 for no limit
fr: Largeur autorisée de l'image, 0 pour aucune limite

source: Max Avatar Height
fr: Hauteur maximimale avatar

source: Allowed image height, 0 for no limit
fr: Hauteur autorisée de l'image, 0 pour aucune limite

source: Max File Size
fr: Taille maximal fichier

source: Allowed avatar file to upload (in KB), 0 for no limit
fr: Taille autorisée de l'upload fichier avatar (en KB), 0 pour aucune limite

source: Temporary Path
fr: Chemin (path) temporaire

source: For temporary storage of avatar
fr: Pour stocker temporairement l'avatar

source: Confirm credential
fr: Confirmer les identifiants

source: Please type the word.
fr: Merci d'entrer le mot.

source: User profile and services.
fr: Management des comptes utilisateurs et services associés

source: All
fr: Tout

source: Activated user
fr: Utilisateur confirmé

source: Pending user
fr: Utilisateur en attente

source: Add user
fr: Ajouter un utilisateur

source: Advanced search
fr: Recherche avancée

source: Role
fr: Rôles

source: Profile
fr: Profil

source: Profile field
fr: Champs profil

source: Profile dress up
fr: Habillage Profil

source: Field privacy
fr: Confidentialité

source: Form
fr: Formulaire

source: Plugin management
fr: Gestion Plugins

source: Timeline
fr: Activité

source: Activity
fr: Activité

source: Quicklink
fr: Lien rapide

source: User log
fr: Logs utilisateur

source: Deleted users
fr: Utilisateurs supprimés

source: Inquiry
fr: Recherche Compte

source: User account
fr: Compte utilisateur

source: User profile
fr: Profil utilisateur

source: Roles
fr: Rôles

source: Profile fields
fr: Champs profil

source: Forms
fr: Formulaire

source: Password
fr: Mot de passe

source: Display name
fr: Pseudo

source: Gender
fr: Genre

source: Birthdate
fr: Date de naissance

source: Active
fr: Confirmer

source: Register time
fr: Date inscription

source: Activation time
fr: Date activation

source: Disabled time
fr: Date désactivée

source: Deleted time
fr: Date supprimée

source: Level
fr: Niveau

source: Last modified
fr: Dernière modification

source: Personal website
fr: Site web personnel

source: Short bio
fr: Courte Bio

source: Register IP
fr: IP d\'inscription

source: Social tools
fr: Réseaux sociaux

source: Tool name
fr: Nom réseau

source: ID or URL
fr: Numéro ou URL

source: User action
fr: Action utilisateur

source: Logout
fr: Se déconnecter

source: Edit user info failed
fr: L'édition des informations utilisateurs a échoué

source: Edit user info successfully
fr: L'édition des informations utilisateurs a réussi

source: Replace user avatar failed
fr: Le changement d'avatar utilisateur a échoué

source: Replace user avatar successfully
fr: Le changement d'avatar utilisateur a réussi

source: Delete this group successfully
fr: La supprimer du groupe a réussi

source: Base info
fr: Informations générales

source: User was not found.
fr: L'utilisateur n'a pas été trouvé

source: Add user failed: user already exists.
fr: L'ajout de l'utilisateur a échoué : l'utilisateur existe déja.

source: Add user failed: invalid operation.
fr: L'ajout de l'utilisateur a échoué : l'opération n'est pas valide.

source: Add user successfully
fr: L'ajout de l'utilisateur a réussi

source: Enable user failed: invalid uid.
fr: L'activation de l'utilisateur a échoué : l'uid (numéro utilisateur) n'est pas valide.

source: %d users enabled.
fr: %d utilisateurs activés.

source: Disable user failed: invalid uid.
fr: La désactivation de l'utilisateur a échoué : l'uid (numéro utilisateur) n'est pas valide.

source: %d disable user successfully
fr: %d utilisaterus désactivés avec succès

source: Delete user failed: invalid uid
fr: La suppression de l'utilisateur a échoué : l'uid (numéro utilisateur) n'est pas valide

source: %d delete user successfully
fr: %d utilisateurs supprimés avec succès

source: Activate user failed: invalid uid.
fr: La confirmation de l'utilisateur a échoué : l'uid (numéro utilisateur) n'est pas valide.

source: %d users activated.
fr: %d utilisateurs confirmés.

source: Role assignment failed: invalid parameters.
fr: L'affectation du rôle a échoué : paramètres non valides.

source: Role assignment failed: invalid user ids.
fr: L'affectation du rôle a échoué : uid (numéro utilisateur) non valide.

source: Role assignment failed: invalid operation.
fr: L'affectation du rôle a échoué : opération non valide.

source: Role assignment failed.
fr: L'affectation du rôle a échoué.

source: Role assignment succeeded.
fr: Succès de l'affectation du rôle.

source: Clear failed.
fr: Le nettoyage a échoué.

source: Clear all deleted user successfully.
fr: Le nettoyage de tous les utilsateurs supprimés a été un succès.

source: Profile dress-up data saved successfully.
fr: Habillage des données de profil enregistré avec succès.

source: Privacy set up failed: invalid field.
fr: Le paramétrage de la confidentialité a échoué : champs non valide.

source: Privacy set up failed: invalid privacy.
fr: Le paramétrage de la confidentialité a échoué : confidentialité non valide.

source: Privacy set up failed: update error.
fr: Le paramétrage de la confidentialité a échoué : erreur de mise à jour

source: Privacy set up successfully.
fr: Le paramétrage de la confidentialité a été un succès.

source: User removed from the role.
fr: L'utilisateur a été supprimé du rôle.

source: User not in the role.
fr: L'utilisateur n'est pas dans le rôle.

source: User added to the role.
fr: L'utilisateur a été ajouté au rôle.

source: User already in the role.
fr: L'utilisateur est déja dans ce rôle.

source: User not found.
fr: Utilisateur non trouvé.

source: Users of role %s
fr: Utilisateurs du rôle %s

source: Basic profile
fr: Informations générales

source: Edit user:
fr: Editer l\'utilisateur :

source: Replace with default avatar.
fr: Remplacer par l\'avatar par défaut

source: This user doesn't have any you can view
fr: Aucune information n\'est visible pour cet utilisateur

source: Are you sure delete this group?
fr: Etes-vous sûr de vouloir supprimer ce groupe?

source: Register form
fr: Formulaire d\'inscription

source: Profile complete form
fr: Formulaire profil complété

source: Submit
fr: Valider

source: Inquire of user via ID, username, display name or email.
fr: Rechercher le compte par numéro, nom utilisateur, pseudo ou email.

source: Activated
fr: Confirmé

source: Not activated
fr: Non confirmé

source: Enabled
fr: Activé

source: Disabled
fr: Désactivé

source: Yes
fr: Oui

source: Unavailable
fr: Non disponible

source: Today
fr: Aujourd\'hui

source: Last week
fr: Semaine dernière

source: Last month
fr: Mois dernier

source: History
fr: Historique

source: Register num
fr: Nombre d\'inscriptions

source: Activated num
fr: Nombre de confirmés

source: Pending num
fr: Nombre en attente

source: Top 10 registered IP
fr: Top 10 IP enregistrées

source: None
fr: Aucun

source: Sort by key:
fr: Trier par :

source: Edit
fr: Editer

source: View log
fr: Voir les logs

source: Activated time
fr: Date de confirmation

source: Last login time
fr: Date dernière connexion

source: Last login ip
fr: Dernière IP de connexion

source: Login count
fr: Nombre de connexion

source: Sort by:
fr: Trié par :

source: Are you sure to delete this user?
fr: Etes-vous sûr de vouloir supprimer cet utilisateur?

source: Are you sure to delete these users?
fr: Etes-vous sûr de vouloir supprimer ces utilisateurs?

source: Are you sure to delete all of these users?
fr: Etes-vous sûr de vouloir supprimer tous ces utilisateurs?

source: Displayname
fr: Pseudo

source: Clear the users
fr: Nettoyer les utilisateurs

source: Clear all deleted users
fr: Nettoyer tous les utilisateurs supprimés

source: No user matched your request.
fr: Aucun utilisateur ne correspond à votre requête.

source: Created time
fr: Date de création

source: Last login
fr: Dernière connexion

source: Null
fr: Vide

source: Item name
fr: Nom de l\'élément

source: From module
fr: Du module

source: Display
fr: Affichage

source: Items displayed on the homepage timeline
fr: Eléments affichés sur la page d\'activité

source: No
fr: Non

source: Activities
fr: Activités

source: Activities items repository
fr: Répertoire des logs Activité

source: Items to display on the user\'s homepage, Drag items vertically to determine the order displays
fr: Eléments à afficher sur la page utilisateur, glisser les éléments verticalement pour choisir l\'ordre d\'affichage

source: Quicklinks
fr: Liens rapides

source: Quicklinks items repository
fr: Répertoire des valeurs de liens rapides

source: Basic field
fr: Informations générales

source: Field title can be edited for display.
fr: Le nom du champs peut être édité pour l\'affichage.

source: Field
fr: Champs

source: Default setting
fr: Paramètre par défaut

source: Forced setting
fr: Paramètre forcé

source: Field title
fr: Nom du champs

source: Search
fr: Rechercher

source: Required
fr: Requis

source: Compound
fr: Organiser

source: Compound to organize a group of fields.
fr: Organiser pour composer un groupe de champs

source: Privacy policy: set default value for profile field privacy setting. If `Forced` is set, user can not change privacy for corresponding field.
fr: Politique de confidentialité : choisir la valeur par défaut pour le paramétrage de la confidentialité du profil. Si la valeur `Forcé` est choisie, l\'utilisateur ne peut pas changer la confidentialité du champs correspondant.

source: Add group
fr: Ajouter un groupe

source: Field display on profile page
fr: Champs affiché sur la page de profil

source: Title
fr: Titre

source: Data will not be saved until `Save` button is hit.
fr: Les données ne seront pas enregistrées avant que le bouton `Enregistrer` ne soit cliqué.

source: Click to choose a group for the field to add.
fr: Cliquer pour choisir le groupe du champs à ajouter.

source: Click to add a group.
fr: Cliquer pour ajouter un groupe.

source: Cancel
fr: Annuler

source: Save
fr: Enregistrer

source: Changes are not saved yet. Would you still like to leave this page?
fr: Les changements n\'ont pas été enregistrés. Voulez-vous toujours quitter cette page?

source: Create a group before adding.
fr: Créer un groupe avant d\'ajouter.

source: Admin roles
fr: Rôles admin

source: Front roles
fr: Rôles côté Utilisateur

source: Name
fr: Nom

source: Users in role
fr: Utilisateurs dans le rôle

source: Front
fr: Accueil

source: User id or name
fr: Numéro utilisateur (uid) ou nom

source: Users
fr: Utilisateurs

source: User id
fr: Numéro utilisateur

source: None user in this role.
fr: Aucun utilisateur dans ce rôle.

source: Active State
fr: Statut confirmation

source: Enable State
fr: Statut activation

source: Select roles
fr: Selectionner les rôles

source: Apply
fr: Appliquer

source: Inactive
fr: Non confirmé

source: Pending
fr: En attente

source: Register time from
fr: Date d\'inscription après le

source: Register time to
fr: Date d\'inscription avant le

source: Delete
fr: Supprimer

source: Passwords don\'t match.
fr: Les mots de passe ne correspondent pas.

source: Username is already taken.
fr: Le nom utilisateur est déja pris.

source: Email is already taken.
fr: L\'email est déja pris.

source: Display name is already taken.
fr: Le pseudo est déja pris

source: Back to users list
fr: Retour à la liste utilisateurs

source: Email invalid
fr: Email non valide

source: Password confirm
fr: Confirmation mot de passe

source: Enable
fr: Activer

source: Disable
fr: Désactiver

source: Front role
fr: Rôle côté Utilisateur

source: Admin role
fr: Rôle côté Admin

source: Last three months
fr: 3 derniers mois

source: Last six months
fr: 6 derniers mois

source: Last year
fr: Dernière année

source: Assign role
fr: Allouer le rôle

source: Remove role
fr: Supprimer le rôle

source: Are you sure active this account, it can not be return
fr: Etes-vous sûr de vouloir confirmer ce compte, cela ne peut pas être annulé

source: Are you sure active these accounts, it can not be return
fr: Etes-vous sûr de vouloir confirmer ce compte, cela ne peut être annulé

source: Choose at least one item before submission.
fr: Choisir au moins un élement avant de soumettre

source: Confirm password
fr: Confirmer le mot de passe

source: Activate
fr: Confirmer

source: Invalid email.
fr: Email non valide

source: Activation state
fr: Statut confirmation

source: User ID
fr: N° Utilisateur

source: Search result
fr: Résultat de recherche

source: No pending user.
fr: Aucun utilisateur en attente.

source: Edit user
fr: Editer l\'utilisateur

source: Are you sure to delete this group?
fr: Etes-vous sûr de vouloir supprimer ce groupe?
